In [2]:
import pandas as pd

In [3]:
data = pd.read_csv('pokemon.txt')

In [4]:
unique_types = pd.unique(data[['Type 1', 'Type 2']].values.ravel())

unique_types = unique_types[~pd.isnull(unique_types)]

print(unique_types)

['Grass' 'Poison' 'Fire' 'Flying' 'Dragon' 'Water' 'Bug' 'Normal'
 'Electric' 'Ground' 'Fairy' 'Fighting' 'Psychic' 'Rock' 'Steel' 'Ice'
 'Ghost' 'Dark']

In [6]:
data2 = pd.read_csv('ttest_machine.txt')

In [8]:
data2

  New_machine Old_machine
0               42.1 42.7
1                 41 43.6
2               41.3 43.8
3               41.8 43.3
4               42.4 42.5
5               42.8 43.5
6               43.2 43.1
7               42.3 41.7
8                 41.8 44
9               42.7 44.1

In [9]:
data2 = {'New_machine': [42.1, 41, 41.3, 41.8, 42.4, 42.8, 43.2, 42.3, 41.8, 42.7],
        'Old_machine': [42.7, 43.6, 43.8, 43.3, 42.5, 43.5, 43.1, 41.7, 44, 44.1]}
df = pd.DataFrame(data2)

In [10]:
df

   New_machine  Old_machine
0         42.1         42.7
1         41.0         43.6
2         41.3         43.8
3         41.8         43.3
4         42.4         42.5
5         42.8         43.5
6         43.2         43.1
7         42.3         41.7
8         41.8         44.0
9         42.7         44.1

In [11]:
mean1 = df['New_machine'].mean()
std1 = df['New_machine'].std(ddof=1)

print(mean1)
print(std1)

42.14
0.6834552736727638

In [12]:
mean2 = df['Old_machine'].mean()
std2 = df['Old_machine'].std(ddof=1)

print(mean2)
print(std2)

43.230000000000004
0.7498888806572157

In [17]:
#New Machine
sample_mean1 = 42.14
sample_std1 = 0.683
n1 = 9

#Old Machine
sample_mean2 = 43.230
sample_std2 = 0.749
n2 = 9

In [18]:
from statistics import math

pooled_sample_std = math.sqrt(
    ((n1-1)*sample_std1**2 + (n2-1)*sample_std2**2)/(n1+n2-2))
statistic = (sample_mean1-sample_mean2)/(pooled_sample_std*math.sqrt((1/n1)+(1/n2)))
statistic

-3.225959796921501

In [19]:
from scipy.stats import t

print("P value is: ", 1- t.cdf(statistic,n1+n2-2))
print("Critical Value of z is: ", t.ppf(0.025, n1+n2-2))

P value is:  0.9973592676876388
Critical Value of z is:  -2.1199052992210112